from random import *
n = randint(1,999)
print(n,": ",end="")
ed_des = {1:"один",2:"два",3:"три",4:"четыре",5:"пять",6:"шесть",7:"семь",8:"восемь",9:"девять",\
          11:"одиннадцать",12:"двенадцать",13:"тринадцать",14:"четырнадцать",15:"пятнадцать",16:"шестнадцать",\
          17:"семнадцать",18:"восемнадцать",19:"девятнадцать"}
des = {1:"десять",2:"двадцать",3:"тридцать",4:"сорок",5:"пятьдесят",6:"шестьдесят",7:"семьдесят",8:"восемьдесят",9:"девяносто"}
st = {1:"сто",2:"двести",3:"триста",4:"четыреста",5:"пятьсот",6:"шестьсот",7:"семьсот",8:"восемьсот",9:"девятьсот"}
if n<20 and n!=10:
    print(ed_des[n])
elif 19<n<100 or n == 10:
    print(des[n//10],ed_des[n%10])
elif n<1000:
    if n%100>20 or n%100==10:
        print(st[n//100],des[n%100//10],ed_des[n % 10])
    else:
        print(st[n//100], ed_des[n % 100])
